integration-test/src/test/resources/soap/store-log-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="urn:riv:itintegration:registry:1"
    xmlns:ns2="urn:riv:informationsecurity:auditing:log:2"
    xmlns:ns3="urn:riv:informationsecurity:auditing:log:StoreLogResponder:2">
  <soapenv:Header>
    <ns1:LogicalAddress>IT-TEST</ns1:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <ns3:StoreLog>
      <ns3:log>
        <ns2:logId>it-log-002</ns2:logId>
        <ns2:system>
          <ns2:systemId>WEBCERT</ns2:systemId>
          <ns2:systemName>Webcert</ns2:systemName>
        </ns2:system>
        <ns2:activity>
          <ns2:activityType>Läsa</ns2:activityType>
          <ns2:activityLevel>Avdelning</ns2:activityLevel>
          <ns2:startDate>2024-11-09T08:00:00</ns2:startDate>
        </ns2:activity>
        <ns2:user>
          <ns2:userId>it-user-002</ns2:userId>
          <ns2:assignment>Läkare</ns2:assignment>
          <ns2:careProvider>
            <ns2:careProviderId>TSTNMT2321000156-ALFA</ns2:careProviderId>
            <ns2:careProviderName>Alfa Regionen</ns2:careProviderName>
          </ns2:careProvider>
          <ns2:careUnit>
            <ns2:careUnitId>TSTNMT2321000156-ALMC</ns2:careUnitId>
            <ns2:careUnitName>Alfa Medicincentrum</ns2:careUnitName>
          </ns2:careUnit>
        </ns2:user>
        <ns2:resources>
          <ns2:resource>
            <ns2:resourceType>Intyg</ns2:resourceType>
            <ns2:patient>
              <ns2:patientId>
                <ns2:root>1.2.752.129.2.1.3.1</ns2:root>
                <ns2:extension>190101010101</ns2:extension>
              </ns2:patientId>
            </ns2:patient>
            <ns2:careProvider>
              <ns2:careProviderId>TSTNMT2321000156-ALFA</ns2:careProviderId>
              <ns2:careProviderName>Alfa Regionen</ns2:careProviderName>
            </ns2:careProvider>
            <ns2:careUnit>
              <ns2:careUnitId>TSTNMT2321000156-ALMC</ns2:careUnitId>
              <ns2:careUnitName>Alfa Medicincentrum</ns2:careUnitName>
            </ns2:careUnit>
          </ns2:resource>
        </ns2:resources>
      </ns3:log>
    </ns3:StoreLog>
  </soapenv:Body>
</soapenv:Envelope>
